### SQLAlchemy

In [33]:
import pandas as pd
import numpy as np
from datetime import datetime
import random

In [34]:
import sqlalchemy
# from sqlalchemy import create_engine
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import sessionmaker
from sqlalchemy import Column, Integer, String, Date, Float

In [35]:
engine = sqlalchemy.create_engine('sqlite:///arad_db.db')

In [36]:
session = sessionmaker(bind=engine)()

In [37]:
Base = declarative_base()

In [21]:
url = 'https://www.cnb.cz/cnb/STAT.ARADY_PKG.VYSTUP?p_period=1&p_sort=1&p_des=50&p_sestuid=1538&p_uka=1%2C2%2C3&p_strid=AAD&p_od=200512&p_do=209912&p_lang=CS&p_format=2&p_decsep=.'

In [22]:
df = pd.read_csv(url, sep='|',skiprows=0,verbose=False,encoding ='utf-8',header=0)
df.iloc[:,0] = pd.to_datetime(df.iloc[:,0])

In [23]:
df.head()

      Období  UK1 Na spotřebu  UK2 Na bydlení  UK3 Ostatní
0 2005-12-31         182036.4        282662.2      58149.7
1 2006-01-31         181932.9        287555.3      58207.3
2 2006-02-28         182050.8        292363.9      58634.9
3 2006-03-31         183489.5        298946.3      59563.1
4 2006-04-30         184419.0        304568.2      60349.1

### Create table

In [38]:
class Loans(Base):
    __tablename__ = 'loans'
    ide = Column(Integer,primary_key=True)
    datum = Column(Date)
    spotreba = Column(Float)
    bydleni = Column(Float)
    ostatni = Column(Float)
    
    def __repr__(self):
        return "<Loans(Datum='%s', spotreba='%s, bydleni='%s, ostatni='%s')>" % (self.datum, self.spotreba, self.bydleni, self.ostatni)

In [39]:
Loans

__main__.Loans

In [40]:
Base.metadata.create_all(engine)

### Add data

In [ ]:
for index, row in df.iterrows():
    print(row['c1'], row['c2'], index)

In [ ]:
loan = Loans(row)

In [21]:
user1 = User(username='Adam',password='password')

In [22]:
user1.username

'Adam'

In [10]:
ouruser = session.query(User).filter_by(username='Adam')
ouruser

In [12]:
user1 is ouruser

False

In [35]:
user3 = User(username='Tom',password='password')

In [36]:
session.add(user3)

In [37]:
session.commit()

### Querrying

In [38]:
for instance in session.query(User).order_by(User.username):
    print(type(instance))
    print(instance)

<class '__main__.User'>
<User(name='Adam', password='password')>
<class '__main__.User'>
<User(name='Ondra', password='password')>
<class '__main__.User'>
<User(name='Tom', password='password')>

In [41]:
User.query.all()

AttributeError: type object 'User' has no attribute 'query'

In [47]:
df = pd.DataFrame([{'c1':10, 'c2':100}, {'c1':11,'c2':110}, {'c1':12,'c2':120}])

In [48]:
df

   c1   c2
0  10  100
1  11  110
2  12  120

In [96]:
for index, row in df.iterrows():
    print(row['c1'], row['c2'], index)

10 100 0
11 110 1
12 120 2

In [75]:
a = df.iterrows()
a

In [74]:
list(a)[0]

(0, c1     10
 c2    100
 Name: 0, dtype: int64)

In [90]:
row = next(df.iterrows())[1]
row

c1     10
c2    100
Name: 0, dtype: int64

In [93]:
for number in row:
    print(number)

10
100